InformationRegisters/ВыполнениеДействийСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеДействийСтационара</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеРежима</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеСтационара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияМедсестрыСтационара</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоВечер</Name>
					<Comment>Для параметров Температурного листа определяет, утренний это или вечерний замер показателя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга, не хранится на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДействияМедсестрыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДействияМедсестрыСтационара</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнениеВводомЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовоеЗначениеДиаграммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ДинамикаПоказателейПациента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПоказатели();
	
	Если Показатели.Количество() = 1 Тогда
		ТекущиеДанные = Показатели.Получить(0);
		Если ТекущиеДанные <> Неопределено Тогда
			ДействиеСтационара = ТекущиеДанные.Значение;
			ИмяКолонки = ТекущиеДанные.Представление;
				   
			Если ЗначениеЗаполнено(ДействиеСтационара) Тогда 
			   ОбновитьДиаграмму(ДействиеСтационара, ИмяКолонки, Параметры.Медкарта);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказатели()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВыполнениеДействийСтационара.ДействиеСтационара КАК ДействиеСтационара,
	                      |	ВыполнениеДействийСтационара.ДействиеСтационара.Представление КАК Представление
	                      |ИЗ
	                      |	РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
	                      |ГДЕ
	                      |	ВыполнениеДействийСтационара.Клиент = &Клиент
	                      |	И ((ВЫРАЗИТЬ(ВыполнениеДействийСтационара.ДействиеСтационара КАК Справочник.ДействияМедсестрыСтационара).ВыполнениеВводомЗначения
	                      |	ИЛИ ВЫРАЗИТЬ(ВыполнениеДействийСтационара.ДействиеСтационара КАК Справочник.Номенклатура).ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)))");
						  
	Запрос.УстановитьПараметр("Клиент",Параметры.Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Показатели.Добавить(Выборка.ДействиеСтационара,Выборка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграмму(ДействиеСтационара,ИмяКолонки,МедицинскаяКарта)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыполнениеДействийСтационара.ДатаВремяВыполнения КАК ДатаВремя,
	                      |	ВыполнениеДействийСтационара.Значение,
	                      |	ЕСТЬNULL(ВыполнениеДействийСтационара.ДействиеСтационара.БазовоеЗначениеДиаграммы, 0) КАК БазовоеЗначение
	                      |ИЗ
	                      |	РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
	                      |ГДЕ
	                      |	ВыполнениеДействийСтационара.ДействиеСтационара = &ДействиеСтационара
	                      |	И ВыполнениеДействийСтационара.Клиент = &Клиент
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВремя");
	Запрос.УстановитьПараметр("ДействиеСтационара",ДействиеСтационара);
	Запрос.УстановитьПараметр("Клиент",Параметры.Клиент);
	
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	
	Диаграмма = Новый Диаграмма();
	
	Диаграмма.КоличествоСерий = 0; 
	Диаграмма.КоличествоТочек = 0; 
	Диаграмма.ТипДиаграммы = ТипДиаграммы.ГрафикСОбластями;	
	
	Диаграмма.МаксимумСерий = МаксимумСерий.Ограничено; 
	Диаграмма.МаксимумСерийКоличество = 7; 
	Диаграмма.ВидПодписей = ВидПодписейКДиаграмме.Значение; 
	Диаграмма.ОбластьЗаголовка.Текст = "Динамика показателя: " + ИмяКолонки; 
	
	Если ВыборкаДанных.Следующий() Тогда
		Диаграмма.БазовоеЗначение = ВыборкаДанных.БазовоеЗначение;
	КонецЕсли;
	ВыборкаДанных.Сбросить();
	
	Диаграмма.Обновление = Ложь; 
	
	Диаграмма.КоличествоСерий = 1; 
	Диаграмма.Серии[0].Текст = ИмяКолонки;
	
	Пока ВыборкаДанных.Следующий() Цикл 
		Точка = Диаграмма.УстановитьТочку(ВыборкаДанных.ДатаВремя);
		Точка.Текст = Формат(ВыборкаДанных.ДатаВремя, "ДФ='дд.ММ.гггг ЧЧ.мм'");
		Диаграмма.УстановитьЗначение(Точка, 0, ВыборкаДанных.Значение);
	КонецЦикла; 
	
	Диаграмма.Обновление = Истина;
	
	ВыборкаДанных.Сбросить();
	
	ПоказателиЗначения.Очистить();
	Пока ВыборкаДанных.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ПоказателиЗначения.Добавить(),ВыборкаДанных)	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Показатели.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ДействиеСтационара = ТекущиеДанные.Значение;
		ИмяКолонки = ТекущиеДанные.Представление;
			   
		Если ЗначениеЗаполнено(ДействиеСтационара) Тогда 
		   ОбновитьДиаграмму(ДействиеСтационара, ИмяКолонки, Параметры.Медкарта);
		КонецЕсли;
	КонецЕсли;
   
КонецПроцедуры
